# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of join statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [3]:
#Your code here
import sqlite3
import pandas as pd

conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
c = conn.cursor()

## Display the names of all the employees in Boston.
Hint: join the employees and offices tables.

In [4]:
#Your code here


c.execute("""select firstName, lastName from employees
                        join offices
                        using (officeCode) WHERE city = 'Boston';
                       """)

df = pd.DataFrame(c.fetchall())
df.head()

       0          1
0  Julie   Firrelli
1  Steve  Patterson

## Do any offices have no employees?
Hint: Combine the employees and offices tables and use a group by.

In [5]:
#Your code here
c.execute("""select city, count(employeeNumber) from offices
                        left join employees
                        on offices.officeCode = employees.officeCode
                        group by 1;
                       """).fetchall()

# df = pd.DataFrame(c.fetchall())
# # print(len(df))
# df

[('Boston', 2),
 ('London', 2),
 ('NYC', 2),
 ('Paris', 5),
 ('San Francisco', 6),
 ('Sydney', 4),
 ('Tokyo', 2)]

In [6]:
# c.execute("""select officeCode from employees;""").fetchall()
# df = pd.DataFrame(c.fetchall())
# df.head()

c.execute("""select officeCode from offices;""")
df = pd.DataFrame(c.fetchall())
df.head()

   0
0  1
1  2
2  3
3  4
4  5

## Write 3 Questions of your own and answer them

In [7]:
# Answers will vary

In [8]:
# Your code here

In [9]:
# Your code here

In [10]:
# Your code here

## Level Up: Display the names of each product each employee has sold

In [24]:
# Your code here
c.execute('''SELECT firstName, lastName, productName from employees 
                                        join customers
                                        on employees.employeeNumber = 
                                        customers.salesRepEmployeeNumber
                                        join orders
                                        on customers.customerNumber =
                                        orders.customerNumber
                                        join orderdetails
                                        on orders.orderNumber =
                                        orderdetails.orderNumber
                                        join products on 
                                        orderdetails.productCode = 
                                        products.productCode
                                        ''')

df = pd.DataFrame(c.fetchall())
print(len(df))
df.head()

2996

        0         1                                            2
0  Leslie  Jennings                               1958 Setra Bus
1  Leslie  Jennings                       1940 Ford Pickup Truck
2  Leslie  Jennings                      1939 Cadillac Limousine
3  Leslie  Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
4  Leslie  Jennings                            1968 Ford Mustang

## Level Up: Display the Number of Products each employee has sold

In [26]:
#Your code here

c.execute('''SELECT firstName, lastName, count(productName) from employees 
                                        join customers
                                        on employees.employeeNumber = 
                                        customers.salesRepEmployeeNumber
                                        join orders
                                        on customers.customerNumber =
                                        orders.customerNumber
                                        join orderdetails
                                        on orders.orderNumber =
                                        orderdetails.orderNumber
                                        join products on 
                                        orderdetails.productCode = 
                                        products.productCode group by 1,2
                                        ''')

df = pd.DataFrame(c.fetchall())
print(len(df))
df

15

           0          1    2
0       Andy     Fixter  185
1      Barry      Jones  220
2   Foon Yue      Tseng  142
3     George     Vanauf  211
4     Gerard  Hernandez  396
5      Julie   Firrelli  124
6      Larry       Bott  236
7     Leslie   Jennings  331
8     Leslie   Thompson  114
9       Loui     Bondur  177
10      Mami      Nishi  137
11    Martin     Gerard  114
12    Pamela   Castillo  272
13     Peter      Marsh  185
14     Steve  Patterson  152

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!